{
    "class_name": "Model",
    "config": {
        "name": "model_1",
        "layers": [
            {
                "name": "encoder_input",
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        196,
                        512
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "encoder_input"
                },
                "inbound_nodes": []
            },
            {
                "name": "lambda_1",
                "class_name": "Lambda",
                "config": {
                    "name": "lambda_1",
                    "trainable": true,
                    "function": [
                        "4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoBS9oEbWVhbikB2gF4qQByBgAAAPpNQzpcVXNlcnNcVXNlclxEZXNrdG9wXE1hc3RlcnNcRGlz\nc2VydGF0aW9uXGltYWdlX2NhcHRpb25pbmdcbW9kZWxzXGRlY29kZXIucHnaCDxsYW1iZGE+kwAA\nAPMAAAAA\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "arguments": {}
                },
                "inbound_nodes": [
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dense_5",
                "class_name": "Dense",
                "config": {
                    "name": "dense_5",
                    "trainable": true,
                    "units": 512,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "lambda_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_5",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_5",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "lambda_3",
                "class_name": "Lambda",
                "config": {
                    "name": "lambda_3",
                    "trainable": true,
                    "function": [
                        "4wEAAAAAAAAAAQAAAAMAAABTAAAAcwwAAAB0AGoBfABkAYMCUwApAk7pAQAAACkC2gFL2gtleHBh\nbmRfZGltcykB2gF4qQByBQAAAPpNQzpcVXNlcnNcVXNlclxEZXNrdG9wXE1hc3RlcnNcRGlzc2Vy\ndGF0aW9uXGltYWdlX2NhcHRpb25pbmdcbW9kZWxzXGRlY29kZXIucHnaCDxsYW1iZGE+4wAAAPMA\nAAAA\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "arguments": {}
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dense_2",
                "class_name": "Dense",
                "config": {
                    "name": "dense_2",
                    "trainable": true,
                    "units": 512,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dense_1",
                "class_name": "Dense",
                "config": {
                    "name": "dense_1",
                    "trainable": true,
                    "units": 512,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "lambda_3",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_6",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_9",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_12",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_15",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_18",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_21",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_24",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_27",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_30",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_33",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_36",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_39",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_42",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_45",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_48",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_51",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_54",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_57",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_60",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_63",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_66",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_69",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_72",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_75",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_78",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_81",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_84",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_87",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_90",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "add_1",
                "class_name": "Add",
                "config": {
                    "name": "add_1",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_2",
                            0,
                            0,
                            {}
                        ],
                        [
                            "dense_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "lambda_4",
                "class_name": "Lambda",
                "config": {
                    "name": "lambda_4",
                    "trainable": true,
                    "function": [
                        "4wEAAAAAAAAAAQAAAAIAAABTAAAAcwoAAAB0AGoBfACDAVMAKQFOKQLaAUvaBHRhbmgpAdoBeKkA\ncgQAAAD6TUM6XFVzZXJzXFVzZXJcRGVza3RvcFxNYXN0ZXJzXERpc3NlcnRhdGlvblxpbWFnZV9j\nYXB0aW9uaW5nXG1vZGVsc1xkZWNvZGVyLnB52gg8bGFtYmRhPugAAADzAAAAAA==\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "arguments": {}
                },
                "inbound_nodes": [
                    [
                        [
                            "add_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dense_4",
                "class_name": "Dense",
                "config": {
                    "name": "dense_4",
                    "trainable": true,
                    "units": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "lambda_4",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_7",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_10",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_13",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_16",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_19",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_22",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_25",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_28",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_31",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_34",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_37",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_40",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_43",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_46",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_49",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_52",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_55",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_58",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_61",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_64",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_67",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_70",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_73",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_76",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_79",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_82",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_85",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_88",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_91",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "decoder_input",
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        30
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "decoder_input"
                },
                "inbound_nodes": []
            },
            {
                "name": "weights_0",
                "class_name": "Lambda",
                "config": {
                    "name": "weights_0",
                    "trainable": true,
                    "function": [
                        "4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoBS9oHc29mdG1heCkB2gF4qQByBgAAAPpNQzpcVXNlcnNcVXNlclxEZXNrdG9wXE1hc3RlcnNc\nRGlzc2VydGF0aW9uXGltYWdlX2NhcHRpb25pbmdcbW9kZWxzXGRlY29kZXIucHnaCDxsYW1iZGE+\n6wAAAPMAAAAA\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "arguments": {}
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "embedding",
                "class_name": "Embedding",
                "config": {
                    "name": "embedding",
                    "trainable": true,
                    "batch_input_shape": [
                        null,
                        null
                    ],
                    "dtype": "float32",
                    "input_dim": 7373,
                    "output_dim": 512,
                    "embeddings_initializer": {
                        "class_name": "RandomUniform",
                        "config": {
                            "minval": -0.05,
                            "maxval": 0.05,
                            "seed": null
                        }
                    },
                    "embeddings_regularizer": null,
                    "activity_regularizer": null,
                    "embeddings_constraint": null,
                    "mask_zero": true,
                    "input_length": null
                },
                "inbound_nodes": [
                    [
                        [
                            "decoder_input",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dot_1",
                "class_name": "Dot",
                "config": {
                    "name": "dot_1",
                    "trainable": true,
                    "axes": 1,
                    "normalize": false
                },
                "inbound_nodes": [
                    [
                        [
                            "weights_0",
                            0,
                            0,
                            {}
                        ],
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dense_3",
                "class_name": "Dense",
                "config": {
                    "name": "dense_3",
                    "trainable": true,
                    "units": 512,
                    "activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "lambda_3",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_6",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_9",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_12",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_15",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_18",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_21",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_24",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_27",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_30",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_33",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_36",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_39",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_42",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_45",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_48",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_51",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_54",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_57",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_60",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_63",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_66",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_69",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_72",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_75",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_78",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_81",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_84",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_87",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_90",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dropout_1",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_1",
                    "trainable": true,
                    "rate": 0.5,
                    "noise_shape": null,
                    "seed": null
                },
                "inbound_nodes": [
                    [
                        [
                            "embedding",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "lambda_2",
                "class_name": "Lambda",
                "config": {
                    "name": "lambda_2",
                    "trainable": true,
                    "function": [
                        "4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoBS9oEbWVhbikB2gF4qQByBgAAAPpNQzpcVXNlcnNcVXNlclxEZXNrdG9wXE1hc3RlcnNcRGlz\nc2VydGF0aW9uXGltYWdlX2NhcHRpb25pbmdcbW9kZWxzXGRlY29kZXIucHnaCDxsYW1iZGE+mAAA\nAPMAAAAA\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "arguments": {}
                },
                "inbound_nodes": [
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "multiply_1",
                "class_name": "Multiply",
                "config": {
                    "name": "multiply_1",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dot_1",
                            0,
                            0,
                            {}
                        ],
                        [
                            "dense_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "lambda_5",
                "class_name": "Lambda",
                "config": {
                    "name": "lambda_5",
                    "trainable": true,
                    "function": [
                        "4wIAAAAAAAAAAgAAAAQAAABTAAAAcxoAAAB0AGoBfABkAGQAhQJ8AWYCGQBkAWQCjQJTACkDTukB\nAAAAKQHaBGF4aXMpAtoBS9oLZXhwYW5kX2RpbXMpAtoBeNoBdKkAcgcAAAD6TUM6XFVzZXJzXFVz\nZXJcRGVza3RvcFxNYXN0ZXJzXERpc3NlcnRhdGlvblxpbWFnZV9jYXB0aW9uaW5nXG1vZGVsc1xk\nZWNvZGVyLnB52gg8bGFtYmRhPqgAAADzAAAAAA==\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "output_shape": [
                        "4wEAAAAAAAAAAQAAAAQAAABTAAAAcxIAAAB8AGQBGQBkAnwAZAMZAGYDUwApBE7pAAAAAOkBAAAA\n6QIAAACpACkB2gFzcgQAAAByBAAAAPpNQzpcVXNlcnNcVXNlclxEZXNrdG9wXE1hc3RlcnNcRGlz\nc2VydGF0aW9uXGltYWdlX2NhcHRpb25pbmdcbW9kZWxzXGRlY29kZXIucHnaCDxsYW1iZGE+qQAA\nAPMAAAAA\n",
                        null,
                        null
                    ],
                    "output_shape_type": "lambda",
                    "arguments": {
                        "t": 0
                    }
                },
                "inbound_nodes": [
                    [
                        [
                            "dropout_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dense_6",
                "class_name": "Dense",
                "config": {
                    "name": "dense_6",
                    "trainable": true,
                    "units": 512,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "lambda_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "concatenate_1",
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate_1",
                    "trainable": true,
                    "axis": -1
                },
                "inbound_nodes": [
                    [
                        [
                            "multiply_1",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lambda_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_6",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_6",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
