{
    "class_name": "Model",
    "config": {
        "name": "model_1",
        "layers": [
            {
                "name": "encoder_input",
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        196,
                        512
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "encoder_input"
                },
                "inbound_nodes": []
            },
            {
                "name": "lambda_1",
                "class_name": "Lambda",
                "config": {
                    "name": "lambda_1",
                    "trainable": true,
                    "function": [
                        "4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoBS9oEbWVhbikB2gF4qQByBgAAAPofPGlweXRob24taW5wdXQtMjItOThkNWM4Y2RlYTc0PtoI\nPGxhbWJkYT4NAAAAcwAAAAA=\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "arguments": {}
                },
                "inbound_nodes": [
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dense_5",
                "class_name": "Dense",
                "config": {
                    "name": "dense_5",
                    "trainable": true,
                    "units": 512,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "lambda_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_5",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_5",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "lambda_3",
                "class_name": "Lambda",
                "config": {
                    "name": "lambda_3",
                    "trainable": true,
                    "function": [
                        "4wEAAAAAAAAAAQAAAAMAAABTAAAAcwwAAAB0AGoBfABkAYMCUwApAk7pAQAAACkC2gFL2gtleHBh\nbmRfZGltcykB2gF4qQByBQAAAPofPGlweXRob24taW5wdXQtMjEtZjgwODQ1MzRlYzYyPtoIPGxh\nbWJkYT4kAAAAcwAAAAA=\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "arguments": {}
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dot_1",
                "class_name": "Dot",
                "config": {
                    "name": "dot_1",
                    "trainable": true,
                    "axes": 2,
                    "normalize": false
                },
                "inbound_nodes": [
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lambda_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "lambda_4",
                "class_name": "Lambda",
                "config": {
                    "name": "lambda_4",
                    "trainable": true,
                    "function": [
                        "4wEAAAAAAAAAAQAAAAMAAABTAAAAcw4AAAB8AHQAagFkAYMBGwBTACkCTmkAAgAAKQLaAm5w2gRz\ncXJ0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0yMS1mODA4NDUzNGVjNjI+2gg8bGFtYmRh\nPicAAABzAAAAAA==\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "arguments": {}
                },
                "inbound_nodes": [
                    [
                        [
                            "dot_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "decoder_input",
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        30
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "decoder_input"
                },
                "inbound_nodes": []
            },
            {
                "name": "dense_4",
                "class_name": "Dense",
                "config": {
                    "name": "dense_4",
                    "trainable": true,
                    "units": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "lambda_4",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_7",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_10",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_13",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_16",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_19",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_22",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_25",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_28",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_31",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_34",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_37",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_40",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_43",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_46",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_49",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_52",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_55",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_58",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_61",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_64",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_67",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_70",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_73",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_76",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_79",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_82",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_85",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_88",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "lambda_91",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "embedding",
                "class_name": "Embedding",
                "config": {
                    "name": "embedding",
                    "trainable": true,
                    "batch_input_shape": [
                        null,
                        null
                    ],
                    "dtype": "float32",
                    "input_dim": 7373,
                    "output_dim": 512,
                    "embeddings_initializer": {
                        "class_name": "RandomUniform",
                        "config": {
                            "minval": -0.05,
                            "maxval": 0.05,
                            "seed": null
                        }
                    },
                    "embeddings_regularizer": null,
                    "activity_regularizer": null,
                    "embeddings_constraint": null,
                    "mask_zero": true,
                    "input_length": null
                },
                "inbound_nodes": [
                    [
                        [
                            "decoder_input",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "weights_0",
                "class_name": "Lambda",
                "config": {
                    "name": "weights_0",
                    "trainable": true,
                    "function": [
                        "4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoBS9oHc29mdG1heCkB2gF4qQByBgAAAPofPGlweXRob24taW5wdXQtMjEtZjgwODQ1MzRlYzYy\nPtoIPGxhbWJkYT4qAAAAcwAAAAA=\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "arguments": {}
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dropout_1",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_1",
                    "trainable": true,
                    "rate": 0.5,
                    "noise_shape": null,
                    "seed": null
                },
                "inbound_nodes": [
                    [
                        [
                            "embedding",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "lambda_2",
                "class_name": "Lambda",
                "config": {
                    "name": "lambda_2",
                    "trainable": true,
                    "function": [
                        "4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoBS9oEbWVhbikB2gF4qQByBgAAAPofPGlweXRob24taW5wdXQtMjItOThkNWM4Y2RlYTc0PtoI\nPGxhbWJkYT4SAAAAcwAAAAA=\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "arguments": {}
                },
                "inbound_nodes": [
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dot_2",
                "class_name": "Dot",
                "config": {
                    "name": "dot_2",
                    "trainable": true,
                    "axes": 1,
                    "normalize": false
                },
                "inbound_nodes": [
                    [
                        [
                            "weights_0",
                            0,
                            0,
                            {}
                        ],
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "lambda_5",
                "class_name": "Lambda",
                "config": {
                    "name": "lambda_5",
                    "trainable": true,
                    "function": [
                        "4wIAAAAAAAAAAgAAAAQAAABTAAAAcxoAAAB0AGoBfABkAGQAhQJ8AWYCGQBkAWQCjQJTACkDTukB\nAAAAKQHaBGF4aXMpAtoBS9oLZXhwYW5kX2RpbXMpAtoBeNoBdKkAcgcAAAD6HzxpcHl0aG9uLWlu\ncHV0LTIyLTk4ZDVjOGNkZWE3ND7aCDxsYW1iZGE+IgAAAHMAAAAA\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "output_shape": [
                        "4wEAAAAAAAAAAQAAAAQAAABTAAAAcxIAAAB8AGQBGQBkAnwAZAMZAGYDUwApBE7pAAAAAOkBAAAA\n6QIAAACpACkB2gFzcgQAAAByBAAAAPofPGlweXRob24taW5wdXQtMjItOThkNWM4Y2RlYTc0PtoI\nPGxhbWJkYT4iAAAAcwAAAAA=\n",
                        null,
                        null
                    ],
                    "output_shape_type": "lambda",
                    "arguments": {
                        "t": 0
                    }
                },
                "inbound_nodes": [
                    [
                        [
                            "dropout_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dense_6",
                "class_name": "Dense",
                "config": {
                    "name": "dense_6",
                    "trainable": true,
                    "units": 512,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "lambda_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "concatenate_1",
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate_1",
                    "trainable": true,
                    "axis": -1
                },
                "inbound_nodes": [
                    [
                        [
                            "dot_2",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lambda_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_6",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_6",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "lstm_1",
                "class_name": "LSTM",
                "config": {
                    "name": "lstm_1",
                    "trainable": true,
                    "return_sequences": false,
                    "return_state": true,
                    "go_backwards": false,
                    "stateful": false,
                    "unroll": false,
                    "units": 512,
                    "activation": "tanh",
                    "recurrent_activation": "hard_sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                            "gain": 1.0,
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "unit_forget_bias": true,
                    "kernel_regularizer": null,
                    "recurrent_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "recurrent_constraint": null,
                    "bias_constraint": null,
                    "dropout": 0.0,
                    "recurrent_dropout": 0.0,
                    "implementation": 1
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_1",
                            0,
                            0,
                            {}
                        ],
                        [
                            "batch_normalization_5",
                            0,
                            0,
                            {}
                        ],
                        [
                            "batch_normalization_6",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_2",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            0,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_3",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            1,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            1,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_4",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            2,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            2,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_5",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            3,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            3,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_6",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            4,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            4,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_7",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            5,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            5,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_8",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            6,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            6,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_9",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            7,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            7,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_10",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            8,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            8,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_11",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            9,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            9,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_12",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            10,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            10,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_13",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            11,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            11,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_14",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            12,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            12,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_15",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            13,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            13,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_16",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            14,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            14,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_17",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            15,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            15,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_18",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            16,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            16,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_19",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            17,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            17,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_20",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            18,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            18,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_21",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            19,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            19,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_22",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            20,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            20,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_23",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            21,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            21,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_24",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            22,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            22,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_25",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            23,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            23,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_26",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            24,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            24,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_27",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            25,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            25,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_28",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            26,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            26,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_29",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            27,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            27,
                            2,
                            {}
                        ]
                    ],
                    [
                        [
                            "concatenate_30",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            28,
                            0,
                            {}
                        ],
                        [
                            "lstm_1",
                            28,
                            2,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "lambda_6",
                "class_name": "Lambda",
                "config": {
                    "name": "lambda_6",
                    "trainable": true,
                    "function": [
                        "4wEAAAAAAAAAAQAAAAMAAABTAAAAcwwAAAB0AGoBfABkAYMCUwApAk7pAQAAACkC2gFL2gtleHBh\nbmRfZGltcykB2gF4qQByBQAAAPofPGlweXRob24taW5wdXQtMjEtZjgwODQ1MzRlYzYyPtoIPGxh\nbWJkYT4kAAAAcwAAAAA=\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "arguments": {}
                },
                "inbound_nodes": [
                    [
                        [
                            "lstm_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dot_3",
                "class_name": "Dot",
                "config": {
                    "name": "dot_3",
                    "trainable": true,
                    "axes": 2,
                    "normalize": false
                },
                "inbound_nodes": [
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lambda_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "lambda_7",
                "class_name": "Lambda",
                "config": {
                    "name": "lambda_7",
                    "trainable": true,
                    "function": [
                        "4wEAAAAAAAAAAQAAAAMAAABTAAAAcw4AAAB8AHQAagFkAYMBGwBTACkCTmkAAgAAKQLaAm5w2gRz\ncXJ0KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0yMS1mODA4NDUzNGVjNjI+2gg8bGFtYmRh\nPicAAABzAAAAAA==\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "arguments": {}
                },
                "inbound_nodes": [
                    [
                        [
                            "dot_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "weights_1",
                "class_name": "Lambda",
                "config": {
                    "name": "weights_1",
                    "trainable": true,
                    "function": [
                        "4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoBS9oHc29mdG1heCkB2gF4qQByBgAAAPofPGlweXRob24taW5wdXQtMjEtZjgwODQ1MzRlYzYy\nPtoIPGxhbWJkYT4qAAAAcwAAAAA=\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "arguments": {}
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_4",
                            1,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dot_4",
                "class_name": "Dot",
                "config": {
                    "name": "dot_4",
                    "trainable": true,
                    "axes": 1,
                    "normalize": false
                },
                "inbound_nodes": [
                    [
                        [
                            "weights_1",
                            0,
                            0,
                            {}
                        ],
